{
    "home": {
        "firstSection": {
            "title": "Hi, i'm João!",
            "subtitle": "A developer in development",
            "navbar": ["History", "Projects", "Passion", "Contact"]
        },
        "secondSection": {
            "cardTitle": "History",
            "text": ["I'm a developer focused on problems solution with", "criativity", "and", "technology", "Currently, i'm a Information Systems student in ", "Centro de Informática", "from University Federal of Pernambuco and i'm always open to oportunities that makes me learn and, consequently, benefit all ecosystem."]
        },
        "thirdSection": {
            "cardTitle": "Projects",
            "projectsName": ["Hora do Serviço!", "AWR Engenharia", "MyHome"],
            "subtitle": "see more about my projects!"
        },
        "fourthSection": {
            "cardTitle": "Passion - What moves me?",
            "text": ["I'm moved to", "technology ", "since my childhood and always used as a facilitator to the various ideas that I had. That said, learning to programming was ", "emancipator ", "and, while I was learning, I've tried to develop projects that facilitated day-to-day situations. So, I've developed ", "websites ", "and ", "mobile apps ", "from sketch to manage bill, home activities, always using ", "Javascript ", "in all process."]
        },
        "fifthSection": {
            "cardTitle": "Contact - Want to hire me?",
            "inputTitles": ["Your name", "Your email", "Service", "Your social media (optional)", "Message (optional)"],
            "inputLabels": ["What's your name?", "What's your mail?", "What is the contact reason?", "How see more about your company?", "Leave your message! 😀"],
            "buttonText": "send"
        }
        
    },
    "projects": {
        "MyHome": {
            "text": "In this project, for being the first with webdev, i have tried to solve an diary problem that i could find. So, i realized that i could help my family in a better bills management using technology. Thereby, i developed a website that allow to store the many month bills (example: light, water) and, using graphs - Chart.js -, analyze unnecessary expenses. As a result of this project, i learned resposiviness, align, interaction with databases - and how to store them safe -, etc.",
            "subtitle": "click here to see the website",
            "techsText": "Used technologies:"
        },
        "HoraDoServico": {
            "text": "'Hora do Serviço' was my first experience with mobile development (React Native) and i've used old projects concepts - creating accounts with mongoDB, respossiviness, animations, etc -. This solution was developed to auxiliate my familiy in organization of dailys home activites. So, i tried to develop a system of communication more efficient with the family members, declaring each users activites seeking for the simplest user experience for my parents. In this scenario, i believe that the most important learn that i had was about better perfomances in diferrents devices and understanding more about the complexity of a good user experience.",
            "subtitle": "",
            "techsText": "Used technologies:"
        },
        "AWR": {
            "text": "In the construction of this project, i have tried to develop a product that bring the company to the technological world. So, for being one page, i used the React benefits to came with a project that was accessible and helped in company-user connection. Furthermore, i used Next.js, with server side rendering, to do the message connection with the company mail. It was my concern, too, with the google metrics seeking to improve SEO and, consequently, better website search placing.",
            "subtitle": "click here to see the website",
            "techsText": "Used technologies:"
        },
        "Carplit": {
            "text": "In this project we developed an app that centralizes routines of carpool drivers. So, i have participated actively in mobile development, with React Native, of all screens and backend integration - besides the concern of performance, architecture, and mockup fidelity -.",
            "subtitle": "",
            "techsText": "Used technologies:"
        },
        "EVA": {
            "text": "EVA is a web platform of projects built in some UFPE courses. Developing this project i was able to solidify my knowledge in React, Next.js, pure CSS. Beyond that, had the opportunity to develop my communication between the team, study more about choosing technologies in viable ways and challenge myself using google sheets as database.",
            "subtitle": "click here to see the website",
            "techsText": "Used technologies:"
        }
    }
    
}