{
    "home": {
        "firstSection": {
            "title": "Olá, me chamo João!",
            "subtitle": "Um desenvolvedor em desenvolvimento",
            "navbar": ["História", "Projetos", "Paixão", "Contato"]
        },
        "secondSection": {
            "cardTitle": "História",
            "text": ["Sou um desenvolvedor focado em solucionar problemas com", "criatividade", "e", " tecnologia", "Atualmente, curso Sistemas de Informação no", "Centro de informática", "da Universidade Federal de Pernambuco e busco oportunidades que me façam aprender e, consequentemente, beneficiar todo ecossistema."]
        },
        "thirdSection": {
            "cardTitle": "Projetos",
            "projectsName": ["Hora do Serviço!", "AWR Engenharia", "MyHome"],
            "subtitle": "saiba mais sobre meus projetos!"
        },
        "fourthSection": {
            "cardTitle": "Paixão - O que me move?",
            "text": ["Sou movido por ", "tecnologia ", "desde a infância e sempre utilizei como facilitador para as diversas ideias que tive. Diante disso, aprender a programar foi ", "libertador ", "e, enquanto aprendia, procurei desenvolver projetos que facilitam a minha vida e a das pessoas ao meu redor. Então, desenvolvi ", "sites ", "e ", "aplicativos mobile ", "'from sketch' para gerenciamento de contas, atividades da casa, etc - sempre utilizando ", "Javascript ", "em todo o processo -."]
        },
        "fifthSection": {
            "cardTitle": "Contato - Deseja me contratar?",
            "inputTitles": ["Seu nome", "Seu email", "Serviço", "Suas redes sociais (opcional)", "Mensagem (opcional)"],
            "inputLabels": ["Qual seu nome?", "Qual seu email?", "Qual o motivo do contato?", "Como conhecer sua empresa?", "Deixe aqui sua mensagem! 😀"],
            "buttonText": "enviar"
        }
        
    },
    "projects": {
        "MyHome": {
            "text": "Nesse projeto, por ser o meu primeiro com desenvolvimento web, procurei solucionar um problema que eu encontrasse no meu dia a dia. Então, percebi que poderia auxiliar minha família num melhor gerenciamento das contas de casa com o uso de tecnologia. Assim, desenvolvi um site que permite armazenar as diversas contas mensais (energia, luz, água...) e, por meio de gráficos - Chart.js -, analisar gastos desnecessários. Como consequência desse projeto, pude aprender responsividade, alinhamento, interação com banco de dados - e como guardá-los com segurança -, etc.",
            "subtitle": "clique aqui para ver o site",
            "techsText": "Tecnologias Utilizadas:"
        },
        "HoraDoServico": {
            "text": "Hora do Serviço! foi minha primeira experiência com desenvolvimento mobile (React Native) e utilizei conceitos dos projetos passados - criação de contas com banco de dados (mongoDB), responsividade, animações, etc -. O motivo de desenvolvimento desse foi para auxiliar minha família na organização das atividades diárias. Então, procurei desenvolver um sistema de comunicação mais eficaz com os integrantes de uma casa, declarando as atividades de cada usuário buscando uma exeperiência mais acessível possível aos meus pais. Assim, acredito que o meu mais marcante aprendizado foi sobre melhores performances em diferentes dispositivos e entender um pouco sobre a complexidade de uma boa experiência de usuário.",
            "subtitle": "",
            "techsText": "Tecnologias Utilizadas:"
        },
        "AWR": {
            "text": "Na construção desse projeto procurei desenvolver um produto que trouxesse a empresa para o mundo digital. Então, por ser uma única página, utilizei das facilidades do React para trazer um produto acessível que auxiliasse na conexão da empresa com o público alvo. Além disso, utilizei da facilidade “server side rendering” do nextJS para fazer o envio das informações de contato diretamente para o email da empresa. Me preocupei, também, com as métricas do Google para fazer aumentar o SEO e, consequentemente, aumentar a colocação do site em pesquisas.",
            "subtitle": "clique aqui para ver o site",
            "techsText": "Tecnologias Utilizadas:"
        },
        "Carplit": {
            "text": "No desenvolvimento desse projeto desenvolvemos um aplicativo que centraliza as rotinas de quem oferece caronas e impacta diretamente na organização do motorista. Dessa maneira, participei ativamente no desenvolvimento, com React Native, de todas as telas e integração com o backend - além da preocupação com arquitetura, performance e fidelidade ao mockup -.",
            "subtitle": "",
            "techsText": "Tecnologias Utilizadas:"
        },
        "EVA": {
            "text": "EVA é uma plataforma de exibição interativa dos trabalhos da interseção de arte, computação, design e expressão gráfica desenvolvidos nas disciplinas de Introdução à Programação, Introdução à Multimídia, Computação Musical, Jogos Digitais, Criatividade Computacional e Design Gerativo da UFPE. No desenvolvimento desse projeto pude solidificar meus conhecimentos sobre React, Next.js, estilização e CSS puro. Além disso, tive a oportunidade de desenvolver minha comunicação entre a equipe e liderar o time de desenvolvimento frontend precisando pensar e estudar sobre a mais viável escolha de tecnologias além de me desafiar utilizando uma planilha do Google como banco de dados.",
            "subtitle": "clique aqui para ver o site",
            "techsText": "Tecnologias Utilizadas:"
        }
    }
    
}